{
  "dish_name": "Classic Swedish Beef Rydberg",
  "description": "A traditional Swedish dish featuring tender beef, crispy potatoes, and onions, served with a rich mustard cream sauce.",
  "servings": 4,
  "ingredients": [
    {
      "item": "Beef tenderloin, diced",
      "quantity": "500 grams"
    },
    {
      "item": "Potatoes, peeled and diced",
      "quantity": "600 grams"
    },
    {
      "item": "Yellow onion, finely chopped",
      "quantity": "1 large"
    },
    {
      "item": "Butter",
      "quantity": "4 tablespoons"
    },
    {
      "item": "Vegetable oil",
      "quantity": "2 tablespoons"
    },
    {
      "item": "Salt",
      "quantity": "To taste"
    },
    {
      "item": "Black pepper, freshly ground",
      "quantity": "To taste"
    },
    {
      "item": "Dijon mustard",
      "quantity": "2 tablespoons"
    },
    {
      "item": "Heavy cream",
      "quantity": "100 milliliters"
    },
    {
      "item": "Fresh parsley, chopped",
      "quantity": "2 tablespoons"
    },
    {
      "item": "Capers",
      "quantity": "2 tablespoons"
    }
  ],
  "instructions": [
    {
      "section_title": "Preparation",
      "steps": [
        {
          "step": "Cut the beef tenderloin into small cubes and set aside."
        },
        {
          "step": "Peel the potatoes and dice them into small cubes of similar size to the beef."
        },
        {
          "step": "Finely chop the large yellow onion."
        }
      ]
    },
    {
      "section_title": "Cooking",
      "steps": [
        {
          "step": "Heat 2 tablespoons of butter and 1 tablespoon of vegetable oil in a large skillet over medium heat."
        },
        {
          "step": "Add the diced potatoes and cook, stirring occasionally, for about 15-20 minutes or until they are golden and crispy. Season with salt and pepper to taste. Remove from the skillet and set aside."
        },
        {
          "step": "In the same skillet, add 1 tablespoon of butter and sauté the chopped onion until soft and translucent, about 5 minutes. Remove from the skillet and set aside."
        },
        {
          "step": "Add the remaining butter and a tablespoon of vegetable oil to the skillet. Increase the heat to medium-high and add the diced beef."
        },
        {
          "step": "Cook the beef until browned on the outside but still pink inside, about 3-4 minutes. Season with salt and pepper to taste. Be careful not to overcook the beef."
        }
      ]
    },
    {
      "section_title": "Sauce and Assembly",
      "steps": [
        {
          "step": "In a small pan, stir together the Dijon mustard and heavy cream over low heat until combined and warm. Do not boil."
        },
        {
          "step": "Arrange the crispy potatoes, sautéed onions, and cooked beef on a serving platter."
        },
        {
          "step": "Drizzle the mustard cream sauce over the beef and garnish with chopped fresh parsley and capers. Serve immediately."
        }
      ]
    }
  ]
}