{
  "title": "Duck Breast with Potato Dauphinoise and Redcurrant-Dijon Sauce",
  "description": "A sophisticated dish featuring succulent duck breast paired perfectly with creamy potato dauphinoise and a tangy redcurrant-Dijon sauce, ideal for a refined dinner gathering.",
  "servings": 4,
  "ingredients": [
    {
      "item": "Duck breasts",
      "quantity": "4 pieces"
    },
    {
      "item": "Salt",
      "quantity": "to taste"
    },
    {
      "item": "Black pepper, freshly ground",
      "quantity": "to taste"
    },
    {
      "item": "Butter",
      "quantity": "30g"
    },
    {
      "item": "Garlic, minced",
      "quantity": "2 cloves"
    },
    {
      "item": "Heavy cream",
      "quantity": "300ml"
    },
    {
      "item": "Whole milk",
      "quantity": "100ml"
    },
    {
      "item": "Potatoes, thinly sliced",
      "quantity": "800g"
    },
    {
      "item": "Gruyère cheese, grated",
      "quantity": "100g"
    },
    {
      "item": "Olive oil",
      "quantity": "1 tablespoon"
    },
    {
      "item": "Redcurrant jelly",
      "quantity": "3 tablespoons"
    },
    {
      "item": "Dijon mustard",
      "quantity": "1 tablespoon"
    },
    {
      "item": "Chicken stock",
      "quantity": "150ml"
    },
    {
      "item": "Shallots, finely chopped",
      "quantity": "2"
    }
  ],
  "instructions": [
    {
      "section_title": "Prepare the Potato Dauphinoise",
      "steps": [
        {
          "step": "Preheat the oven to 190°C (375°F)."
        },
        {
          "step": "In a saucepan, melt the butter over medium heat, then add minced garlic and sauté until fragrant."
        },
        {
          "step": "Stir in the heavy cream and whole milk, and bring to a gentle simmer."
        },
        {
          "step": "Layer the thinly sliced potatoes in a greased baking dish, and season each layer with salt and pepper."
        },
        {
          "step": "Pour the simmered cream mixture over the potatoes and top with grated Gruyère cheese."
        },
        {
          "step": "Bake in the preheated oven for 45-50 minutes, or until the top is golden and the potatoes are tender."
        }
      ]
    },
    {
      "section_title": "Cook the Duck Breasts",
      "steps": [
        {
          "step": "While the potatoes are baking, score the skin of the duck breasts in a crisscross pattern."
        },
        {
          "step": "Season the duck breasts with salt and freshly ground black pepper."
        },
        {
          "step": "Place duck breasts skin-side down in a cold frying pan, then place over medium heat."
        },
        {
          "step": "Cook the duck until the skin is crispy and golden, about 6-8 minutes. Flip and cook for another 4-5 minutes or until desired doneness."
        },
        {
          "step": "Remove the duck breasts from the pan and let rest for at least 5 minutes before slicing."
        }
      ]
    },
    {
      "section_title": "Prepare the Redcurrant-Dijon Sauce",
      "steps": [
        {
          "step": "In the same frying pan, add olive oil and sauté the finely chopped shallots until soft."
        },
        {
          "step": "Stir in redcurrant jelly and Dijon mustard, mixing until smooth."
        },
        {
          "step": "Pour in the chicken stock and bring the mixture to a simmer, allowing the sauce to thicken slightly."
        },
        {
          "step": "Adjust seasoning with salt and pepper as needed. Strain the sauce if desired for a smoother consistency."
        }
      ]
    },
    {
      "section_title": "Assemble and Serve",
      "steps": [
        {
          "step": "Slice the duck breasts and arrange them on a plate alongside a portion of potato dauphinoise."
        },
        {
          "step": "Drizzle the redcurrant-Dijon sauce over the duck and serve immediately."
        }
      ]
    }
  ]
}