{
  "dish_name": "Egg & Bacon Breakfast Quesadillas",
  "description": "A delicious and hearty breakfast quesadilla filled with crispy bacon, fluffy scrambled eggs, and melted cheese, all wrapped in a golden-brown tortilla.",
  "servings": 4,
  "ingredients": [
    {
      "item": "Tortillas, large",
      "quantity": "4"
    },
    {
      "item": "Bacon strips",
      "quantity": "8"
    },
    {
      "item": "Eggs, large",
      "quantity": "6"
    },
    {
      "item": "Milk",
      "quantity": "60 ml (4 tablespoons)"
    },
    {
      "item": "Cheddar cheese, shredded",
      "quantity": "200 g"
    },
    {
      "item": "Butter",
      "quantity": "15 g (1 tablespoon)"
    },
    {
      "item": "Black pepper",
      "quantity": "1/2 teaspoon"
    },
    {
      "item": "Salt",
      "quantity": "1/2 teaspoon"
    },
    {
      "item": "Chives, chopped",
      "quantity": "2 tablespoons"
    }
  ],
  "instructions": [
    {
      "section_title": "Preparation",
      "steps": [
        {
          "step": "Chop the chives finely and set aside."
        },
        {
          "step": "Shred the cheddar cheese if not pre-shredded."
        }
      ]
    },
    {
      "section_title": "Cook Bacon",
      "steps": [
        {
          "step": "In a large skillet, cook the bacon strips over medium heat until crispy, about 6-8 minutes."
        },
        {
          "step": "Remove bacon from the skillet and place on a paper towel-lined plate to drain excess grease. Once cooled, crumble the bacon into smaller pieces."
        }
      ]
    },
    {
      "section_title": "Prepare Eggs",
      "steps": [
        {
          "step": "In a bowl, whisk together eggs, milk, salt, and black pepper until well combined."
        },
        {
          "step": "In the same skillet used for the bacon, melt the butter over medium heat."
        },
        {
          "step": "Pour in the egg mixture and cook, gently stirring, until the eggs are softly scrambled and slightly undercooked. Remove from heat and set aside."
        }
      ]
    },
    {
      "section_title": "Assemble and Cook Quesadillas",
      "steps": [
        {
          "step": "Lay the tortillas flat and evenly distribute cheese, scrambled eggs, bacon, and chives over one half of each tortilla."
        },
        {
          "step": "Fold the tortillas in half to enclose the filling."
        },
        {
          "step": "Heat a clean skillet over medium heat and cook each quesadilla for about 2-3 minutes on each side, or until the tortilla is golden brown and the cheese is melted."
        }
      ]
    }
  ]
}