{
  "title": "Green Egg Sandwich",
  "description": "A vibrant and delicious sandwich featuring perfectly cooked green eggs, creamy avocado, peppery rocket, and toasted sourdough bread.",
  "servings": 2,
  "ingredients": [
    {
      "item": "Eggs",
      "quantity": "4"
    },
    {
      "item": "Butter",
      "quantity": "1 tablespoon"
    },
    {
      "item": "Spinach, fresh",
      "quantity": "50 grams"
    },
    {
      "item": "Milk",
      "quantity": "2 tablespoons"
    },
    {
      "item": "Salt",
      "quantity": "1/2 teaspoon"
    },
    {
      "item": "Black pepper, ground",
      "quantity": "1/4 teaspoon"
    },
    {
      "item": "Avocado, ripe, peeled and pitted",
      "quantity": "1"
    },
    {
      "item": "Sourdough bread",
      "quantity": "4 slices"
    },
    {
      "item": "Rocket, fresh",
      "quantity": "60 grams"
    },
    {
      "item": "Lemon juice",
      "quantity": "1 teaspoon"
    },
    {
      "item": "Olive oil",
      "quantity": "1 tablespoon"
    },
    {
      "item": "Salt, for seasoning",
      "quantity": "to taste"
    },
    {
      "item": "Black pepper, for seasoning",
      "quantity": "to taste"
    }
  ],
  "instructions": [
    {
      "section_title": "Prepare the Ingredients",
      "steps": [
        {
          "step": "Wash the spinach and rocket thoroughly under running water to remove any dirt or debris. Pat them dry with a kitchen towel or paper towels."
        },
        {
          "step": "In a blender, add the spinach and milk. Blend until smooth to create a spinach puree."
        },
        {
          "step": "Mash the avocado in a small bowl and mix with lemon juice to prevent it from browning. Season with a pinch of salt and black pepper."
        }
      ]
    },
    {
      "section_title": "Make the Green Eggs",
      "steps": [
        {
          "step": "In a medium bowl, whisk together the eggs and spinach puree until fully combined. Season with salt and black pepper."
        },
        {
          "step": "Heat a non-stick frying pan over medium heat and add the butter. Once the butter is melted and slightly foamy, pour in the egg mixture."
        },
        {
          "step": "Gently stir the eggs with a spatula, scraping from the edges to the center, until the eggs begin to set but are still slightly runny. Remove from heat, as the eggs will continue to cook with residual heat."
        }
      ]
    },
    {
      "section_title": "Assemble the Sandwich",
      "steps": [
        {
          "step": "Toast the sourdough slices in a toaster or under a grill until golden and crispy."
        },
        {
          "step": "Spread an even layer of mashed avocado onto each slice of toasted sourdough."
        },
        {
          "step": "Place an equal amount of scrambled green eggs onto the avocado-topped slices of bread."
        },
        {
          "step": "Top the eggs with a handful of fresh rocket leaves."
        },
        {
          "step": "Drizzle a small amount of olive oil over the rocket, and season with salt and pepper to taste."
        },
        {
          "step": "Place the remaining slices of sourdough on top of each sandwich to close."
        },
        {
          "step": "Serve immediately and enjoy your vibrant Green Egg Sandwich!"
        }
      ]
    }
  ]
}