{
  "title": "Lemon Butter Garlic Salmon",
  "description": "A simple and delicious dish featuring flaky salmon fillets cooked in a flavorful lemon butter garlic sauce, perfect for a quick and elegant dinner.",
  "servings": 4,
  "ingredients": [
    {
      "name": "Salmon fillets, skin-on",
      "quantity": "4 (about 150g each)"
    },
    {
      "name": "Lemon juice, freshly squeezed",
      "quantity": "2 tablespoons"
    },
    {
      "name": "Lemon zest",
      "quantity": "1 teaspoon"
    },
    {
      "name": "Garlic cloves, minced",
      "quantity": "3"
    },
    {
      "name": "Butter",
      "quantity": "50 grams"
    },
    {
      "name": "Fresh parsley, chopped",
      "quantity": "2 tablespoons"
    },
    {
      "name": "Salt",
      "quantity": "to taste"
    },
    {
      "name": "Black pepper, ground",
      "quantity": "to taste"
    },
    {
      "name": "Olive oil",
      "quantity": "2 tablespoons"
    }
  ],
  "instructions": [
    {
      "section_title": "Preparation",
      "steps": [
        {
          "text": "Pat the salmon fillets dry with paper towels and season both sides with salt and black pepper."
        },
        {
          "text": "Mince the garlic cloves and chop the fresh parsley."
        },
        {
          "text": "Zest the lemon to get 1 teaspoon of lemon zest, then squeeze to obtain 2 tablespoons of lemon juice."
        }
      ]
    },
    {
      "section_title": "Cooking the Salmon",
      "steps": [
        {
          "text": "Heat the olive oil in a large non-stick skillet over medium-high heat."
        },
        {
          "text": "Place the salmon fillets skin-side down in the pan. Sear for 3-4 minutes until the skin is crispy."
        },
        {
          "text": "Carefully flip the fillets and cook for another 2-3 minutes or until the salmon is just cooked through. Adjust time according to the thickness of the fillets. Remove the salmon from the skillet and set aside."
        }
      ]
    },
    {
      "section_title": "Preparing the Sauce",
      "steps": [
        {
          "text": "In the same skillet, reduce the heat to medium and add the butter. Allow it to melt."
        },
        {
          "text": "Add the minced garlic and cook for 30 seconds until fragrant, being careful not to burn it."
        },
        {
          "text": "Stir in the lemon juice and lemon zest, and let the sauce simmer for about 1 minute."
        }
      ]
    },
    {
      "section_title": "Finishing Touches",
      "steps": [
        {
          "text": "Return the salmon fillets to the skillet, spooning the butter sauce over the tops of the fillets."
        },
        {
          "text": "Cook for another 1-2 minutes to warm through and fully coat the salmon with the sauce."
        },
        {
          "text": "Sprinkle with chopped fresh parsley before serving."
        }
      ]
    }
  ]
}