{
  "dish_name": "Panna Cotta with Raspberry Sauce",
  "description": "A classic Italian dessert, panna cotta is a creamy, smooth custard. This version is paired with a vibrant and tangy raspberry sauce, offering a perfect balance of sweet and tart flavors.",
  "servings": 4,
  "ingredients": [
    {
      "item": "Heavy cream",
      "quantity": "500 ml"
    },
    {
      "item": "Granulated sugar",
      "quantity": "100 g"
    },
    {
      "item": "Vanilla extract",
      "quantity": "1 tsp"
    },
    {
      "item": "Gelatin sheets",
      "quantity": "3 sheets"
    },
    {
      "item": "Raspberries, fresh",
      "quantity": "200 g"
    },
    {
      "item": "Granulated sugar",
      "quantity": "50 g"
    },
    {
      "item": "Lemon juice, freshly squeezed",
      "quantity": "1 tbsp"
    },
    {
      "item": "Water",
      "quantity": "2 tbsp"
    }
  ],
  "instructions": [
    {
      "section_title": "Prepare the Panna Cotta",
      "steps": [
        {
          "step": "Soak the gelatin sheets in a bowl of cold water for 5 minutes to soften."
        },
        {
          "step": "In a saucepan over medium heat, combine the heavy cream and 100 g of granulated sugar. Stir occasionally until the sugar is dissolved and the mixture is warm, but not boiling."
        },
        {
          "step": "Remove the saucepan from the heat. Squeeze the excess water from the gelatin sheets and add them to the warm cream mixture along with the vanilla extract. Stir until completely dissolved."
        },
        {
          "step": "Pour the mixture into four ramekins or serving glasses. Let them cool at room temperature for 20 minutes."
        },
        {
          "step": "Cover the ramekins with plastic wrap and refrigerate for at least 4 hours, or until set."
        }
      ]
    },
    {
      "section_title": "Make the Raspberry Sauce",
      "steps": [
        {
          "step": "In a small saucepan over medium heat, combine the raspberries, 50 g of granulated sugar, lemon juice, and water."
        },
        {
          "step": "Cook the mixture for about 5-7 minutes, stirring occasionally, until the raspberries break down and the sauce thickens."
        },
        {
          "step": "Remove from heat and strain the sauce through a fine mesh sieve to remove seeds, if desired. Let the sauce cool before serving."
        }
      ]
    },
    {
      "section_title": "Serve the Panna Cotta",
      "steps": [
        {
          "step": "Once the panna cotta is set, carefully run a knife around the edge of each ramekin to loosen the custard."
        },
        {
          "step": "Invert the ramekins onto serving plates; gently shake to release the panna cotta."
        },
        {
          "step": "Drizzle the cooled raspberry sauce generously over each panna cotta and serve immediately."
        }
      ]
    }
  ]
}