{
  "title": "Pastéis de Nata (Portuguese Custard Tarts)",
  "description": "Pastéis de Nata, also known as Portuguese Custard Tarts, are a classic pastry featuring a crispy puff pastry shell filled with a creamy, sweet custard.",
  "servings": 8,
  "ingredients": [
    {
      "name": "Puff pastry, store-bought",
      "quantity": "400 g"
    },
    {
      "name": "Milk, whole",
      "quantity": "300 ml"
    },
    {
      "name": "Heavy cream",
      "quantity": "200 ml"
    },
    {
      "name": "Granulated sugar",
      "quantity": "200 g"
    },
    {
      "name": "All-purpose flour",
      "quantity": "25 g"
    },
    {
      "name": "Egg yolks",
      "quantity": "6 large"
    },
    {
      "name": "Cinnamon stick",
      "quantity": "1"
    },
    {
      "name": "Vanilla extract",
      "quantity": "1 teaspoon"
    },
    {
      "name": "Lemon zest, grated",
      "quantity": "1 teaspoon"
    }
  ],
  "instructions": [
    {
      "section_title": "Prepare the Custard",
      "steps": [
        {
          "text": "In a medium saucepan, whisk together milk, heavy cream, sugar, and flour until smooth."
        },
        {
          "text": "Cook over medium heat, stirring constantly, until the mixture thickens slightly, about 5-7 minutes."
        },
        {
          "text": "Remove from heat and let it cool slightly."
        },
        {
          "text": "In a separate bowl, whisk the egg yolks and slowly add to the milk mixture, stirring continuously."
        },
        {
          "text": "Add the cinnamon stick, vanilla extract, and lemon zest. Mix well and set aside to cool."
        }
      ]
    },
    {
      "section_title": "Prepare the Pastry Shells",
      "steps": [
        {
          "text": "Preheat your oven to 220°C (428°F)."
        },
        {
          "text": "On a lightly floured surface, roll out the puff pastry to about 3 mm thickness."
        },
        {
          "text": "Cut the pastry into rounds slightly larger than the muffin tin cavities."
        },
        {
          "text": "Gently press the pastry rounds into the muffin tin cavities, ensuring the pastry is flush with the sides."
        }
      ]
    },
    {
      "section_title": "Assemble and Bake",
      "steps": [
        {
          "text": "Fill each pastry shell with the cooled custard filling, leaving a small gap at the top."
        },
        {
          "text": "Place the filled muffin tin in the preheated oven."
        },
        {
          "text": "Bake for 15-20 minutes or until the tops are browned and the custard is set."
        },
        {
          "text": "Remove from oven and let the tarts cool in the tin for a few minutes before transferring them to a wire rack to cool completely."
        }
      ]
    }
  ]
}