{
  "title": "Traditional Cacio e Pepe",
  "description": "Cacio e Pepe is a classic Italian pasta dish consisting of simple ingredients that create a rich and creamy flavor with a hint of peppery spice. This recipe ensures authenticity by focusing on technique and quality ingredients.",
  "servings": 4,
  "ingredients": [
    {
      "item": "Spaghetti",
      "quantity": "400 grams"
    },
    {
      "item": "Pecorino Romano cheese, finely grated",
      "quantity": "150 grams"
    },
    {
      "item": "Black pepper, freshly ground",
      "quantity": "2 teaspoons"
    },
    {
      "item": "Salt",
      "quantity": "to taste"
    },
    {
      "item": "Water",
      "quantity": "as needed"
    }
  ],
  "instructions": [
    {
      "section_title": "Cooking the Pasta",
      "steps": [
        {
          "step": "Fill a large pot with water, add a generous amount of salt, and bring to a boil."
        },
        {
          "step": "Add the spaghetti and cook until it is just shy of al dente, about 1 minute less than the package instructions."
        },
        {
          "step": "Reserve 1 cup of pasta water and then drain the spaghetti."
        }
      ]
    },
    {
      "section_title": "Preparing the Sauce",
      "steps": [
        {
          "step": "While the pasta is cooking, in a large skillet, heat the freshly ground black pepper over medium heat for about 1 minute to release its fragrant oils."
        },
        {
          "step": "Add about 2 ladles of the reserved pasta water to the skillet and bring to a simmer."
        }
      ]
    },
    {
      "section_title": "Combining Pasta and Sauce",
      "steps": [
        {
          "step": "Transfer the cooked spaghetti into the skillet with the simmering pepper-water mixture."
        },
        {
          "step": "Add half of the grated Pecorino Romano cheese and begin tossing the pasta quickly using tongs or a pasta fork to combine the cheese with the pasta."
        },
        {
          "step": "Gradually add more cheese and some reserved pasta water as needed to create a creamy sauce that clings to the pasta, continuing to toss until well combined. Adjust the consistency with more pasta water if necessary, ensuring the sauce is smooth and glossy."
        }
      ]
    },
    {
      "section_title": "Serving",
      "steps": [
        {
          "step": "Taste and adjust seasoning with salt and more black pepper if desired."
        },
        {
          "step": "Divide the pasta among four bowls, making sure each portion is well-coated with sauce."
        },
        {
          "step": "Serve immediately while hot, topped with additional grated Pecorino Romano cheese if desired."
        }
      ]
    }
  ]
}